Tekla Open API Reference for Tekla Structures 2025
Polymesh.FromStruct Method
 Converts a struct of polymesh to a
FacetedBrep
.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void FromStruct(
	ref dotPolymesh_t input
)
Public Sub FromStruct (
	ByRef input As dotPolymesh_t
)
Parameters
input
Type: dotPolymesh_t
The input parameter
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace